#+title: Literate Solution of Gladyshev's /ACME Printer Case/

** Calculate the Set of Sufficient Evidence
Based on the model specified above, we calculate the evidence set of
sufficient evidence for the action =add_job_a=, which corresponds to
Alice sending a print job.

#+name: se-add-job-a
#+begin_src shell :var model=ex-acme-smv :results output verbatim
<<shellsetup>> 
echo $model | python3 ../src/calc_evidence.py -o csv -a "add_job_a" -t "sufficient"
#+end_src

#+RESULTS: se-add-job-a
: action,evidence
: add_job_a,{printdir_1: JobA}
: add_job_a,{printdir_1: DelA}
: add_job_a,{printdir_2: JobA}
: add_job_a,{printdir_2: JobB}
: add_job_a,{printdir_2: DelA}
: add_job_a,{printdir_2: DelB}


** Answering the Investigative Question
In order to answer the investigative question, we need to check if an
element of the set of sufficient evidences is contained within the
observed evidence. Since we want to show how the CLI-tool can be used,
we transform the SE-set into a regular expression as illustrated in
[[se-regex]].

#+name: se-regex
#+begin_src shell :var traces=se-add-job-a :results output verbatim raw
PATTERN="("
while read line
do
  if ! [[ (-z "$line" || "$line" == "\n"1 ) ]]
  then
     if ! [[ "$PATTERN" == *"(" ]]
     then
         PATTERN+="|"
     fi
     tline=$(echo $line | sed 's/{/\\{/g' | sed 's/}/\\}/g')
     #tline=$(echo $line | tr '{' '\\{' | tr '}' '\\}')
     PATTERN+="${tline}"
  fi
done <<< $(echo $traces | cut -d"," -f2 | tail -n+2)
PATTERN+=")"
echo $PATTERN
#+end_src

#+RESULTS: se-regex
(\{printdir_1: JobA\}|\{printdir_1: DelA\}|\{printdir_2: JobA\}|\{printdir_2: JobB\}|\{printdir_2: DelA\}|\{printdir_2: DelB\})

Since we operated on the NuSMV-model presented in [[ex-acme-smv]], the
observed evidence presented in [[lst-observed-evidence]] in a
human-oriented form has be translated to the following form:

#+name: e-obs
#+begin_example
{printdir_1: DelB}
{printdir_2: DelB}
#+end_example

Afterwards, we check whether there exists an element in the SE-set
that is part of the observed evidences, put formally
 \[\exists s \in SE(add_job_a, M) \mid s \subseteq E_{obs}\]

#+name: check-s-in-e-obs
#+begin_src shell :var evidence_obs=e-obs pattern=se-regex :results output verbatim
echo $evidence_obs | grep -o -E $pattern
#+end_src

#+RESULTS:
: {printdir_2: DelB}

Since there is such an element \(s \in SE{}\) (={printdir_2: DelB}=)
that exists in \(E_{obs}\), Alice must have printed at least once.

